# SetBoldStatus Method (Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..SetBoldStatus Method (Boolean)
FormattedText Class See Also
---
Sets the characters in the entire text to be bold or not bold.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetBoldStatus(
	bool isBold
)
```

Visual Basic
---
```text
Public Sub SetBoldStatus ( _
	isBold As Boolean _
)
```

Visual C++
---
```text
public:
void SetBoldStatus(
	bool isBold
)
```

# ### Parameters
isBold
    Type: System..::..Boolean The desired bold status of characters in the entire text. True to set bold, false to set not bold.
# See Also
FormattedText Class
SetBoldStatus Overload
Autodesk.Revit.DB Namespace